import streamlit as st

st.markdown("""
✅ Возраст и подписки:
            
- Подписка на депозит наиболее популярна у клиентов от 30 до 55 лет.

- Молодёжь (18–25) и пожилые (60+) менее склонны подписываться.

- В группах 18–25 и 26–35 наблюдается наибольший интерес.

✅ Тип работы:

- Больше всего клиентов в категориях management и blue-collar.

- Более высокий процент подписки у management, technician, entrepreneur.

- Самый низкий уровень у student и housemaid.

✅ Семейное положение:

- Семейное положение влияет на процент подписок, но различия не столь выражены.

- Женатые и одинокие клиенты чаще подписываются, чем разведённые.

✅ Образование:

- Более высокий процент подписки у клиентов с высшим и профессиональным образованием.

- Наименее активны в подписке клиенты с базовым образованием.

✅ Кредиты (ипотечный и персональный):

- Клиенты без ипотечного и персонального кредита чаще подписываются.

- Кредиты уменьшают вероятность подписки на депозит.

✅ Баланс:

- У клиентов с более высоким балансом чаще наблюдаются подписки.

- Средний баланс у подписавшихся выше, чем у остальных.

✅ Длительность звонка (duration):

- Чем дольше разговор, тем выше вероятность подписки.

- Длительность звонка — хороший индикатор заинтересованности.

✅ День последнего контакта:

- Не выявлено зависимости между днём последнего контакта и подпиской.

✅ Предыдущие кампании (poutcome):

- Положительный результат предыдущей кампании значительно повышает шанс подписки.

- Клиенты с «success» в прошлом чаще подписываются снова.

✅ Влияние housing/personal loan и default:

- Клиенты без задолженностей более склонны подписываться.

- У housing loan и personal loan — явный отрицательный эффект.

✅ Подписки по месяцам:

- Месяцы «май» и «август» показывают пики подписок.

- В холодные месяцы подписок меньше.

✅ Возрастные группы:

- Группы «26–35» и «36–45» демонстрируют наибольшую активность.

- Группы «46+» становятся менее активными.
""")